#03.08.2023
name_assistant = input('Я твой ассистент. Меня зовут ')
rise_assistant = 0.53
name_user = input('Как мне к тебе обращаться? ')
age_user = int(input(f'Приятно познакомиться, {name_user}\n\nТеперь я знаю, как тебя зовут. А сколько тебе сейчас лет? '))
rise_user = float(input(f'Ого, ты такой взрослый человек. Представляешь, через 10 лет тебе уже будет {age_user + 10}\n\nРаз уж ты такой взрослый, то может ты еще и высокий... Какой у тебя рост? '))
print(f'Да, уж, ты очень высокий человек, я всего лишь {rise_assistant}! Получается, ты выше меня на {round(rise_user - rise_assistant, 2)}м.\nЯ столько всего о тебе узнала! Я в восторге! Тебя зовут {name_user}, сейчас тебе {age_user} лет и твой рост {rise_user}м.')

print('''Тебе уже не терпится узнать, что я умею? Во список того, чем я могу помочь:\n\n
      1. Поднять настроение\n
      2. Напомнить, когда кормить кота\n
      3. Отключение\n''')

answer = int(input('Что ты выберешь? '))

if answer == 1:
    print('''8 способов поднять настроение:\n
            Съешьте что-нибудь\n
            Выпейте стакан воды\n
            Сполосните лицо прохладной водой\n
            Сделайте небольшую зарядку\n
            Прогуляйтесь на свежем воздухе\n
            Расслабьтесь и подышите\n
            Поговорите с близким человеком\n
            Послушайте приятную музыку''')
elif answer == 2:
    age_cat = int(input('Сколько ей лет? '))
    if age_cat < 1:
        print('Уже пора!')
    elif 1 <= age_cat <= 15:
        print('Тем более пора!')
    else:
        print('Кошки столько не живут :(')
elif answer == 3:
    print('До свидания!')
else:
    print('Введи от 1 до 3')